<details>
<summary>Execution result of "run-all plan" in "envs/dev"</summary>

```terraform
time=2024-03-29T07:41:04Z level=info msg=The stack at /github/workspace/envs/dev will be processed in the following order for command plan:
Group 1
- Module /github/workspace/envs/dev/vpc

Group 2
- Module /github/workspace/envs/dev/ec2


time=2024-03-29T07:41:04Z level=info msg=Downloading Terraform configurations from file:///github/workspace/modules/vpc into /github/workspace/envs/dev/vpc/.terragrunt-cache/PCf29EzL0itKH_o6_I6QSflb_bs/giso1TTMUXQJkC634SOuk6GQWj0 prefix=[/github/workspace/envs/dev/vpc] 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using hashicorp/aws v5.39.0 from the shared cache directory

Terraform has been successfully initialized!

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "tgtest-dev-igw"
        }
      + tags_all = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-dev-igw"
          + "Service"   = "tgtest"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "tgtest-dev-private-rt"
        }
      + tags_all         = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-dev-private-rt"
          + "Service"   = "tgtest"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "tgtest-dev-public-rt"
        }
      + tags_all         = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-dev-public-rt"
          + "Service"   = "tgtest"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.public_web will be created
  + resource "aws_security_group" "public_web" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "tgtest-dev-public-web-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "tgtest-dev-public-web-sg"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-dev-public-web-sg"
          + "Service"   = "tgtest"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tgtest-dev-private-subnet"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-dev-private-subnet"
          + "Service"   = "tgtest"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tgtest-dev-public-subnet"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-dev-public-subnet"
          + "Service"   = "tgtest"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "tgtest-dev-vpc"
        }
      + tags_all                             = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-dev-vpc"
          + "Service"   = "tgtest"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_route_table_id       = (known after apply)
  + public_route_table_id        = (known after apply)
  + public_subnet_id             = (known after apply)
  + public_web_security_group_id = (known after apply)
time=2024-03-29T07:41:15Z level=info msg=Downloading Terraform configurations from file:///github/workspace/modules/ec2 into /github/workspace/envs/dev/ec2/.terragrunt-cache/NW2zHF7ZTyMbTow85pnv10yb3KY/QfoN1PMnAytPab4g4fOyLFMjTX4 prefix=[/github/workspace/envs/dev/ec2] 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using hashicorp/aws v5.39.0 from the shared cache directory

Terraform has been successfully initialized!
data.aws_ssm_parameter.amazonlinux_2023: Reading...
data.aws_ssm_parameter.amazonlinux_2023: Read complete after 1s [id=/aws/service/ami-amazon-linux-latest/al2023-ami-kernel-6.1-x86_64]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_instance_profile.app will be created
  + resource "aws_iam_instance_profile" "app" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "tgtest-dev-app-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "tgtest-dev-app-role"
      + tags_all    = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Service"   = "tgtest"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.app will be created
  + resource "aws_iam_role" "app" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tgtest-dev-app-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Service"   = "tgtest"
        }
      + unique_id             = (known after apply)
    }

  # aws_instance.app will be created
  + resource "aws_instance" "app" {
      + ami                                  = (sensitive value)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "tgtest-dev-app-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "fake"
      + tags                                 = {
          + "Name" = "tgtest-dev-app"
        }
      + tags_all                             = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-dev-app"
          + "Service"   = "tgtest"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>
    